In [1]:
import pandas as pd

In [3]:
df=pd.DataFrame({
    'city':['NYC','London','paris','Tokyo','NYC','paris'],
    'price':[200,150,300,250,180,320]
})

In [4]:
df

     city  price
0     NYC    200
1  London    150
2   paris    300
3   Tokyo    250
4     NYC    180
5   paris    320

In [5]:
## Calculate the mean price for each city

In [9]:
mean_price=df.groupby('city')['price'].mean().to_dict()

In [10]:
mean_price

{'London': 150.0, 'NYC': 190.0, 'Tokyo': 250.0, 'paris': 310.0}

In [ ]:
##Replace each city with each mean price

In [11]:
df['city_encoded']=df['city'].map(mean_price)

In [12]:
df

     city  price  city_encoded
0     NYC    200         190.0
1  London    150         150.0
2   paris    300         310.0
3   Tokyo    250         250.0
4     NYC    180         190.0
5   paris    320         310.0